import 'package:simple_quiz_app/models/question.dart';

const List<Question> DUMMY_QUESTIONS = const [
  Question(
      question: 'تقع مصر في الركن .... من قارة افريقيا',
      answer: 'الشمال الشرقي'),
  Question(
      question: 'توجد جزيرة إلفنتين السياحية في مدينة ....', answer: 'أسوان'),
  Question(
      question: 'تم استيحاء الشكل الهندسي لقبر أغاخان من المعمار ....',
      answer: 'الفاطمي'),
  Question(
      question: 'يُعد معبد .... أكبر معابد مصر القديمة في الحجم',
      answer: 'الكرنك'),
  Question(question: 'تم إنشاء قنطرة المجذوب في عهد', answer: 'محمد علي باشا'),
  Question(question: 'يقع المتحف الغارق في محافظة ....', answer: 'الإسكندرية'),
  Question(
      question:
          'يرمز هيكل الكبش في طريق "الكباش" إلي الإله .... لدي المصريين القدماء',
      answer: 'آمون'),
  Question(
      question:
          'يوجد منزل الأمصيلي بمدينة .... والذي يُعتبر من أهم المعالم الأثرية بها',
      answer: 'رشيد'),
  Question(question: 'توجد طابية عرابي بمحافظة ....', answer: 'دمياط'),
  Question(
      question:
          'تم بناء هرم ميدوم في عهد الملك .... والذي ينتمي إلى الأسرة الرابعة',
      answer: 'سنفرو'),
];

const DUMMY_ANSWERS = [
  ['الشرقي', 'الجنوب الشرقي', 'الشمال الشرقي'],
  ['الأقصر', 'المنيا', 'أسوان'],
  ['الفاطمي', 'العباسي', 'العثماني'],
  ['فيلة', 'الكرنك', 'إدفو'],
  ['محمد علي باشا', 'نابليون بونابرت', 'الخليفة المأمون'],
  ['البحر الأحمر', 'القاهرة', 'الإسكندرية'],
  ['حورس', 'سيت', 'آمون'],
  ['البلينا', 'رشيد', 'الفيوم'],
  ['القاهرة', 'دمياط', 'المنصورة'],
  ['إخناتون', 'رمسيس', 'سنفرو'],
];
